app/Controllers/Domaine.php

    public function add_field()
    {
        helper('form','url');

        $model = new DomaineModel();

        $data = array(
            'intitule' => $this->request->getVar('field_title'),

        );

        if ((new DomaineModel())->insert($data)){
---
INSERT INTO `domaine` (`intitule`) VALUES ('Info')