app/Models/CompetenceModel.php

    public function getSkills()
    {
        return $this->asArray()->findAll();
---
SELECT *
FROM `competence`

    public function getResumeSkills($resume)
    {

        return $this->select(['S.*'])
            ->from($this->table . ' AS S', true)
            ->join('competence_cv AS SCV', 'S.idCompetence = SCV.idCompetence', 'left')
            ->join('cv AS CV', 'CV.idCV = SCV.idCV')
            ->where('SCV.idCV', $resume)
            ->get()->getResultArray();
---
SELECT `S`.*
FROM `competence` AS `S`
LEFT JOIN `competence_cv` AS `SCV` ON `S`.`idCompetence` = `SCV`.`idCompetence`
JOIN `cv` AS `CV` ON `CV`.`idCV` = `SCV`.`idCV`
WHERE `SCV`.`idCV` = ('12')

    public function get_liste_competence($competence = null, $perPage = null, $offset = null)
    {

        // return $this->select(['CP.*','C.intitule AS competence','P.intitule AS metier'])
        //     ->from('competence_profil AS CP', true)
        //     ->join($this->table. ' AS C', 'CP.idCompetence = C.idCompetence', 'left')
        //     ->join('profil AS P', 'P.idProfil = CP.idProfil', 'left')
        //     ->get()->getResultArray();

        if ($competence) {
            return $this->select(['C.*', 'C.intitule AS intitule'])
                ->from($this->table . ' AS C', true)
                ->where('C.archive', '0')
                ->where('C.intitule', $competence)
                ->limit($perPage, $offset)
                ->get()->getResultArray();
        } else {
            return $this->select(['C.*', 'C.intitule AS intitule'])
                ->from($this->table . ' AS C', true)
                ->where('C.archive', '0')
                ->limit($perPage, $offset)
                ->get()->getResultArray();
---
SELECT `C`.*, `C`.`intitule` AS `intitule`
FROM `competence` AS `C`
WHERE `C`.`archive` = '0'

    public function get_by_id($id)
    {
        return $this->where('idCompetence', $id)
            ->get()->getRow();
---
SELECT *
FROM `competence`
WHERE `idCompetence` = '7'