app/Models/CvModel.php

    public function getStudentId($id)
    {
        return $this->select('idEtudiant')
        ->where('idUtilisateur', $id)
        ->first();
---
SELECT `idEtudiant`
FROM `etudiant`
WHERE `idUtilisateur` = '19'
 LIMIT 1

    public function getPersinfo($attribute)
    {
        return $this->select(['E.*',
                            'U.*',
                            'CV.description',
                            'GROUP_CONCAT(P.idProfil) as idProfil, GROUP_CONCAT(P.intitule SEPARATOR " - ") as profils'
                        ])
                    ->from($this->table. ' AS E', true)
                    ->join('utilisateur AS U', 'U.idUtilisateur = E.idUtilisateur')
                    ->join('cv AS CV', 'E.idCV = CV.idCV', 'left')
                    ->join('profil_cv AS PCV', 'PCV.idCV = CV.idCV', 'left')
                    ->join('profil AS P', 'P.idProfil = PCV.idProfil')
                    ->where('E.idEtudiant', $attribute)
                    ->first();
---
SELECT `E`.*, `U`.*, `CV`.`description`, GROUP_CONCAT(P.idProfil) as idProfil, GROUP_CONCAT(P.intitule SEPARATOR " - ") as profils
FROM `etudiant` AS `E`
JOIN `utilisateur` AS `U` ON `U`.`idUtilisateur` = `E`.`idUtilisateur`
LEFT JOIN `cv` AS `CV` ON `E`.`idCV` = `CV`.`idCV`
LEFT JOIN `profil_cv` AS `PCV` ON `PCV`.`idCV` = `CV`.`idCV`
JOIN `profil` AS `P` ON `P`.`idProfil` = `PCV`.`idProfil`
WHERE `E`.`idEtudiant` = ('7')
 LIMIT 1