app/Models/DomaineModel.php

    public function getFields()
    {
        return $this->asArray()->findAll();
---
SELECT *
FROM `domaine`