app/Models/EntrepriseModel.php

                ->limit($perPage, $offset)
                ->get()->getResultArray();
        } else {
            return $this->select(['E.*', 'P.prenom', 'P.nom AS nomPF', 'V.nom'])
                ->from($this->table . ' AS E', true)
                ->join('pointfocal AS P', 'E.idPointFocal = P.idPointFocal', 'left')
                ->join('ville AS V', 'E.idVille = V.idVille', 'left')
                ->where('E.archive', '0')
                ->limit($perPage, $offset)
                ->get()->getResultArray();
---
SELECT `E`.*, `P`.`prenom`, `P`.`nom` AS `nomPF`, `V`.`nom`
FROM `entreprise` AS `E`
LEFT JOIN `pointfocal` AS `P` ON `E`.`idPointFocal` = `P`.`idPointFocal`
LEFT JOIN `ville` AS `V` ON `E`.`idVille` = `V`.`idVille`
WHERE `E`.`archive` = '0'
 LIMIT 10

    public function get_all()
    {
        return $this->select(['E.*', 'P.prenom', 'P.nom AS nomPF', 'V.nom'])
            ->from($this->table . ' AS E', true)
            ->join('pointfocal AS P', 'E.idPointFocal = P.idPointFocal', 'left')
            ->join('ville AS V', 'E.idVille = V.idVille', 'left')
            ->where('E.archive', '0')
            ->get()->getResultArray();
---
SELECT `E`.*, `P`.`prenom`, `P`.`nom` AS `nomPF`, `V`.`nom`
FROM `entreprise` AS `E`
LEFT JOIN `pointfocal` AS `P` ON `E`.`idPointFocal` = `P`.`idPointFocal`
LEFT JOIN `ville` AS `V` ON `E`.`idVille` = `V`.`idVille`
WHERE `E`.`archive` = '0'

    public function getListe() {

        return $this->asArray()->findAll();
---
SELECT *
FROM `entreprise`

    public function entreprisesCount($ville)
    {
        return  $this->select('COUNT(E.idVille) AS villes')
            ->from($this->table . ' AS E', true)
            ->join('ville AS V', 'E.idVille = V.idVille', 'left')
            ->where('V.nom', $ville)
            ->get()->getRow();
---
SELECT COUNT(E.idVille) AS villes
FROM `entreprise` AS `E`
LEFT JOIN `ville` AS `V` ON `E`.`idVille` = `V`.`idVille`
WHERE `V`.`nom` = 'Dakar'