app/Models/EtablissementModel.php

    public function getSchools()
    {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `etablissement`

    public function getSchool($school)
    {
        return $this->select('idEtablissement')
                ->where('nom', $school)
                ->first();
---
SELECT `idEtablissement`
FROM `etablissement`
WHERE `nom` = ''
 LIMIT 1