app/Models/ExperienceModel.php

SELECT *
FROM `experience`
WHERE `idCV` = ('12')
---
    public function getResumeExperiences($resume) {

        return $this->asArray()
                ->where(['idCV' => $resume])
                ->get()->getResultArray();