app/Models/FormationModel.php

    public function add_formation($data, $field, $resume, $studyLevel)
    {
        $this->db->table($this->table)->insert($data);
        $formation = $this->insertID();

        $formationFields = [
            'idDomaine'     =>  $field,
            'idFormation'   =>  $formation
        ];
        $this->db->table('domaine_formation')->insert($formationFields);

        $formationResume = [
            'idFormation'   =>  $formation,
            'idCV'          =>  $resume
        ];
        $this->db->table('formation_cv')->insert($formationResume);

        $formationStudyLevel = [
            'idFormation'   =>  $formation,
            'idNiveauEtude' =>  $studyLevel
        ];
        $this->db->table('niveauetude_formation')->insert($formationStudyLevel);
---
INSERT INTO `formation` (`description`, `dateDebut`, `dateFin`, `idEtablissement`) VALUES (' dfdf', '', '', '9')
INSERT INTO `domaine_formation` (`idDomaine`, `idFormation`) VALUES ('7', 31)
INSERT INTO `formation_cv` (`idFormation`, `idCV`) VALUES (31, ('68'))
INSERT INTO `niveauetude_formation` (`idFormation`, `idNiveauEtude`) VALUES (31, '3')

    public function getResumeFormations($resume)
    {
        return $this->select(['F.idFormation',
                            'F.description',
                            'E.nom AS etablissement',
                            'F.dateDebut',
                            'F.dateFin',
                            'D.intitule AS domaine',
                            'N.intitule AS niveau_etude'
                        ])
                    ->from($this->table. ' AS F', true)
                    ->join('formation_cv AS FCV', 'F.idFormation = FCV.idFormation', 'left')
                    ->join('cv AS CV', 'FCV.idCV = CV.idCV')
                    ->join('etablissement AS E', 'E.idEtablissement = F.idEtablissement', 'left')
                    ->join('domaine_formation AS DF', 'F.idFormation = DF.idFormation', 'left')
                    ->join('domaine AS D', 'DF.idDomaine = D.idDomaine')
                    ->join('niveauetude_formation AS NF', 'F.idFormation = NF.idFormation', 'left')
                    ->join('niveauetude AS N', 'NF.idNiveauEtude = N.idNiveauEtude')
                    ->where('CV.idCV', $resume)
                    ->get()->getResultArray();
---
SELECT `F`.`idFormation`, `F`.`description`, `E`.`nom` AS `etablissement`, `F`.`dateDebut`, `F`.`dateFin`, `D`.`intitule` AS `domaine`, `N`.`intitule` AS `niveau_etude`
FROM `formation` AS `F`
LEFT JOIN `formation_cv` AS `FCV` ON `F`.`idFormation` = `FCV`.`idFormation`
JOIN `cv` AS `CV` ON `FCV`.`idCV` = `CV`.`idCV`
LEFT JOIN `etablissement` AS `E` ON `E`.`idEtablissement` = `F`.`idEtablissement`
LEFT JOIN `domaine_formation` AS `DF` ON `F`.`idFormation` = `DF`.`idFormation`
JOIN `domaine` AS `D` ON `DF`.`idDomaine` = `D`.`idDomaine`
LEFT JOIN `niveauetude_formation` AS `NF` ON `F`.`idFormation` = `NF`.`idFormation`
JOIN `niveauetude` AS `N` ON `NF`.`idNiveauEtude` = `N`.`idNiveauEtude`
WHERE `CV`.`idCV` = ('12')

    public function getCities()
    {
        return $this->select()
                    ->from('ville AS V', true)
                    ->get()->getResultArray();
---
SELECT *
FROM `ville` AS `V`

    public function getStudyLevels()
    {
        return $this->select()
                ->from('niveauetude', true)
                ->findAll();
---
SELECT *
FROM `niveauetude`

    public function formationsCount($ville)
    {
        return  $this->select('COUNT(F.idVille) AS villes')
        ->from($this->table. ' AS F', true)
        ->join('ville AS V', 'F.idVille = V.idVille', 'left')
        ->where('V.nom', $ville)
        ->get()->getRow();
---
SELECT COUNT(F.idVille) AS villes
FROM `formation` AS `F`
LEFT JOIN `ville` AS `V` ON `F`.`idVille` = `V`.`idVille`
WHERE `V`.`nom` = 'Dakar'