app/Models/LanguageModel.php

SELECT `L`.*, `LCV`.`niveau`
FROM `langue` AS `L`
LEFT JOIN `langue_cv` AS `LCV` ON `L`.`idLangue` = `LCV`.`idLangue`
JOIN `cv` AS `CV` ON `CV`.`idCV` = `LCV`.`idCV`
WHERE `LCV`.`idCV` = ('12')
---
    public function getResumeLanguages($resume) {

        return $this->select(['L.*', 'LCV.niveau'])
                    ->from($this->table. ' AS L', true)
                    ->join('langue_cv AS LCV', 'L.idLangue = LCV.idLangue', 'left')
                    ->join('cv AS CV', 'CV.idCV = LCV.idCV')
                    ->where('LCV.idCV', $resume)
                    ->get()->getResultArray();