app/Models/OffreModel.php

SELECT COUNT(*) AS `numrows` FROM `offre`
---
    public function offersNumbers()
    {
        return $this->db->table($this->table)->countAll();

SELECT `O`.*, `op`.`intitule` AS `title`, `op`.`datePublication`, `op`.`statut`, `E`.`nomEntreprise`, `E`.`adresse`, `E`.`logo`, `tc`.`intitule` AS `contractType`, `V`.`nom`, `NE`.`intitule` AS `studyLevel`, `P`.`intitule` AS `profil`
FROM `offre` AS `O`
LEFT JOIN `opportunite` AS `op` ON `O`.`idOpportunite` = `op`.`idOpportunite`
LEFT JOIN `entreprise` AS `E` ON `O`.`idEntreprise` = `E`.`idEntreprise`
LEFT JOIN `typecontrat` AS `tc` ON `O`.`idTypeContrat` = `tc`.`idTypeContrat`
LEFT JOIN `niveauetude` AS `NE` ON `O`.`idNiveauEtude` = `NE`.`idNiveauEtude`
LEFT JOIN `ville` AS `V` ON `O`.`idVille` = `V`.`idVille`
LEFT JOIN `profil` AS `P` ON `O`.`idProfil` = `P`.`idProfil`
WHERE `O`.`archive` = '0'
---
    public function get_all_offers($perPage = null, $offset = null)
    {
        return $this->select([
            'O.*', 'op.intitule AS title',
            'op.datePublication',
            'op.statut',
            'E.nomEntreprise',
            'E.adresse',
            'E.logo',
            'tc.intitule AS contractType',
            'V.nom',
            'NE.intitule AS studyLevel',
            'P.intitule AS profil'
        ])
            ->from($this->table . ' AS O', true)
            ->join('opportunite AS op', 'O.idOpportunite = op.idOpportunite', 'left')
            ->join('entreprise AS E', 'O.idEntreprise = E.idEntreprise', 'left')
            ->join('typecontrat AS tc', 'O.idTypeContrat = tc.idTypeContrat', 'left')
            ->join('niveauetude AS NE', 'O.idNiveauEtude = NE.idNiveauEtude', 'left')
            ->join('ville AS V', 'O.idVille = V.idVille', 'left')
            ->join('profil AS P', 'O.idProfil = P.idProfil', 'left')
            ->where('O.archive', '0')
            ->limit($perPage, $offset)
            ->get()->getResultArray();

SELECT `O`.*, `op`.`intitule` AS `title`, `op`.`datePublication`, `op`.`statut`, `E`.`nomEntreprise`, `E`.`adresse`, `E`.`logo`, `tc`.`intitule` AS `contractType`, `V`.`nom`, `NE`.`intitule` AS `studyLevel`, `P`.`intitule` AS `profil`
FROM `offre` AS `O`
LEFT JOIN `opportunite` AS `op` ON `O`.`idOpportunite` = `op`.`idOpportunite`
LEFT JOIN `entreprise` AS `E` ON `O`.`idEntreprise` = `E`.`idEntreprise`
LEFT JOIN `typecontrat` AS `tc` ON `O`.`idTypeContrat` = `tc`.`idTypeContrat`
LEFT JOIN `niveauetude` AS `NE` ON `O`.`idNiveauEtude` = `NE`.`idNiveauEtude`
LEFT JOIN `ville` AS `V` ON `O`.`idVille` = `V`.`idVille`
LEFT JOIN `profil` AS `P` ON `O`.`idProfil` = `P`.`idProfil`
 LIMIT 10
---
    public function lastsOffers()
    {
        return $this->select([
            'O.*', 'op.intitule AS title',
            'op.datePublication',
            'op.statut',
            'E.nomEntreprise',
            'E.adresse',
            'E.logo',
            'tc.intitule AS contractType',
            'V.nom',
            'NE.intitule AS studyLevel',
            'P.intitule AS profil'
        ])
            ->from($this->table . ' AS O', true)
            ->join('opportunite AS op', 'O.idOpportunite = op.idOpportunite', 'left')
            ->join('entreprise AS E', 'O.idEntreprise = E.idEntreprise', 'left')
            ->join('typecontrat AS tc', 'O.idTypeContrat = tc.idTypeContrat', 'left')
            ->join('niveauetude AS NE', 'O.idNiveauEtude = NE.idNiveauEtude', 'left')
            ->join('ville AS V', 'O.idVille = V.idVille', 'left')
            ->join('profil AS P', 'O.idProfil = P.idProfil', 'left')
            ->limit(10)
            ->get()->getResultArray();

SELECT `O`.*, `op`.`intitule` AS `title`, `op`.`datePublication`, `op`.`statut`, `E`.*, `tc`.`intitule` AS `contractType`, `V`.`nom` AS `nom`, `NE`.`intitule` AS `studyLevel`, `P`.`intitule` AS `profile`
FROM `offre` AS `O`
LEFT JOIN `opportunite` AS `op` ON `O`.`idOpportunite` = `op`.`idOpportunite`
LEFT JOIN `entreprise` AS `E` ON `O`.`idEntreprise` = `E`.`idEntreprise`
LEFT JOIN `typecontrat` AS `tc` ON `O`.`idTypeContrat` = `tc`.`idTypeContrat`
LEFT JOIN `niveauetude` AS `NE` ON `O`.`idNiveauEtude` = `NE`.`idNiveauEtude`
LEFT JOIN `ville` AS `V` ON `O`.`idVille` = `V`.`idVille`
LEFT JOIN `profil` AS `P` ON `O`.`idProfil` = `P`.`idProfil`
WHERE `O`.`idOpportunite` = '10'
 LIMIT 1
---
    public function getOf_by_id($id)
    {


        return $this->select([
            'O.*', 'op.intitule AS title',
            'op.datePublication',
            'op.statut',
            'E.*',
            'tc.intitule AS contractType',
            'V.nom AS nom',
            'NE.intitule AS studyLevel',
            'P.intitule AS profile'
        ])
            ->from($this->table . ' AS O', true)
            ->join('opportunite AS op', 'O.idOpportunite = op.idOpportunite', 'left')
            ->join('entreprise AS E', 'O.idEntreprise = E.idEntreprise', 'left')
            ->join('typecontrat AS tc', 'O.idTypeContrat = tc.idTypeContrat', 'left')
            ->join('niveauetude AS NE', 'O.idNiveauEtude = NE.idNiveauEtude', 'left')
            ->join('ville AS V', 'O.idVille = V.idVille', 'left')
            ->join('profil AS P', 'O.idProfil = P.idProfil', 'left')
            ->where('O.idOpportunite', $id)
            ->first();

UPDATE `opportunite_etudiant` SET `statut` = 'Rejetée'
WHERE `idOpportunite` = '11'
---
    public function rejeter_poste($id)
    {
        $this->db->table('opportunite_etudiant')->update(array('statut' => 'Rejetée'), array('id' => $id));

SELECT `O`.*, `op`.`intitule` AS `title`, `op`.`datePublication`, `STDOP`.`statut`, `E`.*, `tc`.`intitule` AS `contractType`, `V`.`nom`, `NE`.`intitule` AS `studyLevel`, `P`.`intitule` AS `profile`
FROM `offre` AS `O`
LEFT JOIN `opportunite` AS `op` ON `O`.`idOpportunite` = `op`.`idOpportunite`
LEFT JOIN `opportunite_etudiant` AS `STDOP` ON `O`.`idOpportunite` = `STDOP`.`idOpportunite`
LEFT JOIN `etudiant` AS `STD` ON `STD`.`idEtudiant` = `STDOP`.`idEtudiant`
LEFT JOIN `entreprise` AS `E` ON `O`.`idEntreprise` = `E`.`idEntreprise`
LEFT JOIN `typecontrat` AS `tc` ON `O`.`idTypeContrat` = `tc`.`idTypeContrat`
LEFT JOIN `niveauetude` AS `NE` ON `O`.`idNiveauEtude` = `NE`.`idNiveauEtude`
LEFT JOIN `ville` AS `V` ON `O`.`idVille` = `V`.`idVille`
LEFT JOIN `profil` AS `P` ON `O`.`idProfil` = `P`.`idProfil`
WHERE `STD`.`idUtilisateur` = '5'
---
    public function getStudentCandidacies($user_id)
    {
        return $this->select([
            'O.*', 'op.intitule AS title',
            'op.datePublication',
            'STDOP.statut',
            'E.*',
            'tc.intitule AS contractType',
            'V.nom',
            'NE.intitule AS studyLevel',
            'P.intitule AS profile'
        ])
            ->from($this->table . ' AS O', true)
            ->join('opportunite AS op', 'O.idOpportunite = op.idOpportunite', 'left')
            ->join('opportunite_etudiant AS STDOP', 'O.idOpportunite = STDOP.idOpportunite', 'left')
            ->join('etudiant AS STD', 'STD.idEtudiant = STDOP.idEtudiant', 'left')
            ->join('entreprise AS E', 'O.idEntreprise = E.idEntreprise', 'left')
            ->join('typecontrat AS tc', 'O.idTypeContrat = tc.idTypeContrat', 'left')
            ->join('niveauetude AS NE', 'O.idNiveauEtude = NE.idNiveauEtude', 'left')
            ->join('ville AS V', 'O.idVille = V.idVille', 'left')
            ->join('profil AS P', 'O.idProfil = P.idProfil', 'left')
            ->where('STD.idUtilisateur', $user_id)
            ->get()->getResultArray();

SELECT `STD`.`nom`, `STD`.`prenom`, `E`.`nomEntreprise`, `STDOP`.`statut`, `STDOP`.`date_postulee`, `STD`.`idUtilisateur`, `op`.`intitule`, `STDOP`.`idOpportunite`
FROM `offre` AS `O`
JOIN `opportunite` AS `op` ON `O`.`idOpportunite` = `op`.`idOpportunite`
JOIN `opportunite_etudiant` AS `STDOP` ON `O`.`idOpportunite` = `STDOP`.`idOpportunite`
JOIN `etudiant` AS `STD` ON `STD`.`idEtudiant` = `STDOP`.`idEtudiant`
JOIN `entreprise` AS `E` ON `O`.`idEntreprise` = `E`.`idEntreprise`
JOIN `typecontrat` AS `tc` ON `O`.`idTypeContrat` = `tc`.`idTypeContrat`
JOIN `niveauetude` AS `NE` ON `O`.`idNiveauEtude` = `NE`.`idNiveauEtude`
JOIN `ville` AS `V` ON `O`.`idVille` = `V`.`idVille`
JOIN `profil` AS `P` ON `O`.`idProfil` = `P`.`idProfil`
 LIMIT 10
---
    public function getStudentPostule($perPage = null, $offset = null)
    {
        return $this->select([
            'STD.nom',
            'STDOP.id',
            'STD.prenom',
            'E.nomEntreprise',
            'STDOP.statut',
            'STDOP.date_postulee',
            'STD.idUtilisateur',
            'op.intitule',
            'STDOP.idOpportunite',
        ])
            ->from($this->table . ' AS O', true)
            ->join('opportunite AS op', 'O.idOpportunite = op.idOpportunite')
            ->join('opportunite_etudiant AS STDOP', 'O.idOpportunite = STDOP.idOpportunite')
            ->join('etudiant AS STD', 'STD.idEtudiant = STDOP.idEtudiant')
            ->join('entreprise AS E', 'O.idEntreprise = E.idEntreprise')
            ->join('typecontrat AS tc', 'O.idTypeContrat = tc.idTypeContrat')
            ->join('niveauetude AS NE', 'O.idNiveauEtude = NE.idNiveauEtude')
            ->join('ville AS V', 'O.idVille = V.idVille')
            ->join('profil AS P', 'O.idProfil = P.idProfil')
            ->limit($perPage, $offset)
            ->get()->getResultArray();

SELECT *
FROM `opportunite_etudiant` AS `STDOP`
WHERE `STDOP`.`idOpportunite` = '10'
AND `STDOP`.`idEtudiant` IS NULL
 LIMIT 1
---
    public function haveApply($idStudent, $idOffer)
    {
        return $this->select()
            ->from('opportunite_etudiant AS STDOP', true)
            ->where('STDOP.idOpportunite', $idOffer)
            ->where('STDOP.idEtudiant', $idStudent)
            ->first();

SELECT `STD`.`nom`, `STDOP`.`id`, `STD`.`prenom`, `E`.`nomEntreprise`, `STDOP`.`statut`, `STDOP`.`date_postulee`, `STD`.`idUtilisateur`, `op`.`intitule`, `STDOP`.`idOpportunite`, `O`.`dateCloture`
FROM `offre` AS `O`
JOIN `opportunite` AS `op` ON `O`.`idOpportunite` = `op`.`idOpportunite`
JOIN `opportunite_etudiant` AS `STDOP` ON `O`.`idOpportunite` = `STDOP`.`idOpportunite`
JOIN `etudiant` AS `STD` ON `STD`.`idEtudiant` = `STDOP`.`idEtudiant`
JOIN `entreprise` AS `E` ON `O`.`idEntreprise` = `E`.`idEntreprise`
JOIN `typecontrat` AS `tc` ON `O`.`idTypeContrat` = `tc`.`idTypeContrat`
JOIN `niveauetude` AS `NE` ON `O`.`idNiveauEtude` = `NE`.`idNiveauEtude`
JOIN `ville` AS `V` ON `O`.`idVille` = `V`.`idVille`
JOIN `profil` AS `P` ON `O`.`idProfil` = `P`.`idProfil`
WHERE `O`.`idOpportunite` = '10'
---
    public function getOfferCandidacies($offer_id, $perPage = null, $offset = null)
    {
        return $this->select([
            'STD.nom',
            'STDOP.id',
            'STD.prenom',
            'E.nomEntreprise',
            'STDOP.statut',
            'STDOP.date_postulee',
            'STD.idUtilisateur',
            'op.intitule',
            'STDOP.idOpportunite',
            'O.dateCloture'
        ])
            ->from($this->table . ' AS O', true)
            ->join('opportunite AS op', 'O.idOpportunite = op.idOpportunite')
            ->join('opportunite_etudiant AS STDOP', 'O.idOpportunite = STDOP.idOpportunite')
            ->join('etudiant AS STD', 'STD.idEtudiant = STDOP.idEtudiant')
            ->join('entreprise AS E', 'O.idEntreprise = E.idEntreprise')
            ->join('typecontrat AS tc', 'O.idTypeContrat = tc.idTypeContrat')
            ->join('niveauetude AS NE', 'O.idNiveauEtude = NE.idNiveauEtude')
            ->join('ville AS V', 'O.idVille = V.idVille')
            ->join('profil AS P', 'O.idProfil = P.idProfil')
            ->where('O.idOpportunite', $offer_id)
            ->limit($perPage, $offset)
            ->get()->getResultArray();

SELECT `D`.*, count(O.idOpportunite) as total
FROM `domaine` AS `D`
LEFT JOIN `profil` AS `P` ON `P`.`idDomaine` = `D`.`idDomaine`
LEFT JOIN `offre` AS `O` ON `O`.`idProfil` = `P`.`idProfil`
GROUP BY `idDomaine`
---
    public function getFieldOffersCount()
    {
        return $this->select(['D.*', 'count(O.idOpportunite) as total'])
            ->from('domaine AS D', true)
            ->join('profil AS P', 'P.idDomaine = D.idDomaine', 'left')
            ->join($this->table . ' AS O', 'O.idProfil = P.idProfil', 'left')
            ->groupBy('idDomaine')
            ->get()->getResultArray();