app/Models/ProfilModel.php

SELECT `P`.*, `D`.`intitule` AS `field_title`
FROM `profil` AS `P`
LEFT JOIN `domaine` AS `D` ON `D`.`idDomaine` = `P`.`idDomaine`
---
    public function getProfiles()
    {
        return $this->select(['P.*',
                        'D.intitule AS field_title'
                        ])
                    ->from($this->table . ' AS P', true)
                    ->join('domaine AS D', 'D.idDomaine = P.idDomaine', 'left')
                    ->findAll();