app/Models/SecteurModel.php

    public function getSecteurs()
    {
        return $this->asArray()->findAll();
---
SELECT *
FROM `secteur`