app/Models/TypeContratModel.php

    public function get_all_typeContrat()
    {
        return $this->asArray()
                    ->where('archive', 0)
                    ->findAll();
---
SELECT *
FROM `typecontrat`
WHERE `archive` = 0

    public function get_by_id($id)
    {
        return $this->where('idTypeContrat', $id)
                    ->get()->getRow();
---
SELECT *
FROM `typecontrat`
WHERE `idTypeContrat` = '9'