app/Models/UserModel.php

SELECT *
FROM `utilisateur`
WHERE `idUtilisateur` = '5'
OR `email` = '5'
 LIMIT 1
---
	public function getUser($attribute)
	{
		return $this->asArray()
					->where(['idUtilisateur' => $attribute])
					->orWhere(['email' => $attribute])
					->first();

SELECT *
FROM `utilisateur`
WHERE `idUtilisateur` = '19'
 LIMIT 1
---
	public function getEmail($id)
	{
		return $this->asArray()
					->where(['idUtilisateur' => $id])
					->first();

SELECT `U`.*, `ufr`.`intitule` AS `intituleUfr`
FROM `utilisateur` AS `U`
LEFT JOIN `utilisateur_role` AS `UR` ON `UR`.`idUtilisateur` = `U`.`idUtilisateur`
JOIN `role` AS `R` ON `R`.`idRole` = `UR`.`idRole`
LEFT JOIN `ufr` ON `ufr`.`idUfr` = `U`.`idUfr`
WHERE `R`.`intitule` = 'etudiant'
---
    public function getACategoryOfUsers($role)
	{
		return $this->select(['U.*', 'ufr.intitule AS intituleUfr'])
						->from($this->table. ' AS U', true)
						->join('utilisateur_role AS UR', 'UR.idUtilisateur = U.idUtilisateur', 'left')
						->join('role AS R', 'R.idRole = UR.idRole')
						->join('ufr', 'ufr.idUfr = U.idUfr', 'left')
                        ->Where('R.intitule', $role)
						->get()->getResultArray();